docs/site/kilroy19_posth_music_contex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>kilroy19_posth_music_contex</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">kilroy19_posth_music_contex</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga61f567">Posthuman Music Contexts: Live Processing's Impact on Performance Practice in Electroacoustic Music</a>
<ul>
<li><a href="#org403493f">Posthuman</a></li>
<li><a href="#orge17d035">Perf Practice</a></li>
<li><a href="#org6e7aa15">Models</a></li>
<li><a href="#orgd3f606f">Lack of Performer literature</a></li>
<li><a href="#org8a4b7d8">Notation</a></li>
<li><a href="#org0a48860">Recordings</a></li>
<li><a href="#org4869d90">Main issues</a></li>
<li><a href="#orgb5758d9">Live Processing</a></li>
<li><a href="#orgb8ed2d9">Posthuman Practice</a></li>
<li><a href="#orge5f6d37">Definitions</a></li>
<li><a href="#org8a108fd">Oral Recitation</a></li>
<li><a href="#orge1c76b0">Interpretation</a></li>
<li><a href="#orgc758b17">Control</a></li>
<li><a href="#org111e2fc">Live Processing Notation</a></li>
<li><a href="#org339c320">Mediation</a></li>
<li><a href="#org2af22b4">Tropes</a></li>
<li><a href="#org29eb305">Disconnect</a></li>
<li><a href="#org59934f3">Agency and Tropes</a></li>
<li><a href="#orgc0e5162">Posthuman</a></li>
<li><a href="#org4049bc4">Music and Posthuman</a></li>
<li><a href="#org18a3fc6">Mutation in Music</a></li>
<li><a href="#org1367fed">Hybridity in Music</a></li>
<li><a href="#org1e80147">Cyborg in music</a></li>
<li><a href="#org8cf4ca1">Interfaces</a></li>
<li><a href="#orge0d1937">Virtuality in Music</a></li>
<li><a href="#orgbc840a1">Dissembodiment in music</a></li>
<li><a href="#orgad57fdb">Example of non cyborg</a></li>
<li><a href="#orgd8f7ea0">Engineers</a></li>
<li><a href="#org89a8692">Preparation</a></li>
<li><a href="#org7512e32">Engineer as musician</a></li>
<li><a href="#orga14c22a">Agency</a></li>
<li><a href="#org28c4add">Mix of agency</a></li>
<li><a href="#orgc1705db">Performance Space</a></li>
<li><a href="#orgd3e0223">Pedal Cyborg</a></li>
<li><a href="#orgc951187">Posthuman tropes</a></li>
<li><a href="#org4425e77">Controllers</a></li>
<li><a href="#org48c8b8f">table of tropes</a></li>
<li><a href="#org5057082">Agency balance</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga61f567" class="outline-2">
<h2 id="orga61f567">Posthuman Music Contexts: Live Processing's Impact on Performance Practice in Electroacoustic Music</h2>
<div class="outline-text-2" id="text-orga61f567">
</div>
<div id="outline-container-org403493f" class="outline-3">
<h3 id="org403493f">Posthuman</h3>
<div class="outline-text-3" id="text-org403493f">
<p>
Posthuman is everything after the musician plays that adjusts timbre, tuning, dynamics, etc. Everything that gets modified by electronics basically.	
</p>
</div>
</div>
<div id="outline-container-orge17d035" class="outline-3">
<h3 id="orge17d035">Perf Practice</h3>
<div class="outline-text-3" id="text-orge17d035">
<p>
There is an unprecedented amount of variety in the posthuman. Different equipment, contexts, and other factors make a single performane pratice difficult.
</p>
</div>
</div>
<div id="outline-container-org6e7aa15" class="outline-3">
<h3 id="org6e7aa15">Models</h3>
<div class="outline-text-3" id="text-org6e7aa15">
<p>
There are many times that the interaction between player and electronics is modeled after a non electronic analogue, but this is not always the case.
</p>
</div>
</div>
<div id="outline-container-orgd3f606f" class="outline-3">
<h3 id="orgd3f606f">Lack of Performer literature</h3>
<div class="outline-text-3" id="text-orgd3f606f">
<p>
Scholarly literature seems to have a lack of performer-led discourse (well we are performers not scholars after all)
</p>
</div>
</div>
<div id="outline-container-org8a4b7d8" class="outline-3">
<h3 id="org8a4b7d8">Notation</h3>
<div class="outline-text-3" id="text-org8a4b7d8">
<p>
Music notation will never fully represent the details of music when it is performerd. Performers have to create a realization of the notation that addresses the ambiguities of the notated rhythm, rubato, tone, dynamics, intonation, etc. Many different resources are used in this process.
</p>
</div>
</div>
<div id="outline-container-org0a48860" class="outline-3">
<h3 id="org0a48860">Recordings</h3>
<div class="outline-text-3" id="text-org0a48860">
<p>
The main source of contemporary performance practice is recordings, as opposed to treatises and oral traditions previously used.
</p>
</div>
</div>
<div id="outline-container-org4869d90" class="outline-3">
<h3 id="org4869d90">Main issues</h3>
<div class="outline-text-3" id="text-org4869d90">
<p>
The main issues of contemporary performance practice are the performers relationship to the score, and the interpretation of notation.
</p>
</div>
</div>
<div id="outline-container-orgb5758d9" class="outline-3">
<h3 id="orgb5758d9">Live Processing</h3>
<div class="outline-text-3" id="text-orgb5758d9">
<p>
Current models don't adequately describe situations with live processing.
</p>
</div>
</div>
<div id="outline-container-orgb8ed2d9" class="outline-3">
<h3 id="orgb8ed2d9">Posthuman Practice</h3>
<div class="outline-text-3" id="text-orgb8ed2d9">
<p>
Electronics create effects that are impossible or impractical to replicate through acoustic means. There can be a shift in agency and performance priorities and even the performers' conception of themselves on stage.
</p>

<p>
Performers may have to focus on details more than just playing their part. They may need to communicate with engineers to deal with their tone quality, or have to work with new interfaces and sound systems.
</p>
</div>
</div>
<div id="outline-container-orge5f6d37" class="outline-3">
<h3 id="orge5f6d37">Definitions</h3>
<div class="outline-text-3" id="text-orge5f6d37">
<p>
<b>Performance Practice</b> refers to how musicans realize their part in a musical work, either through notation or recalling music learned orally.
</p>
</div>
</div>
<div id="outline-container-org8a108fd" class="outline-3">
<h3 id="org8a108fd">Oral Recitation</h3>
<div class="outline-text-3" id="text-org8a108fd">
<p>
Information can be lost in oral recitation, as it is likely to be different each time. A similar thing happens when performing music from notation.
Eventually oral traditions are forgotten and text resources are the only remnants. Then they have to be reconstructed.
</p>
</div>
</div>
<div id="outline-container-orge1c76b0" class="outline-3">
<h3 id="orge1c76b0">Interpretation</h3>
<div class="outline-text-3" id="text-orge1c76b0">
<p>
Interpretation results from the creative process of performers. The feedback after rehearsals and performances contributes to the evolution of a performance practice. 
</p>
</div>
</div>
<div id="outline-container-orgc758b17" class="outline-3">
<h3 id="orgc758b17">Control</h3>
<div class="outline-text-3" id="text-orgc758b17">
<p>
Performers can engage in different relationships with non-interactive electronics if they have a high degree of control.
</p>
</div>
</div>
<div id="outline-container-org111e2fc" class="outline-3">
<h3 id="org111e2fc">Live Processing Notation</h3>
<div class="outline-text-3" id="text-org111e2fc">
<p>
Live processing often does not fit well into traditional notatione (This therefore is an opportunity for posthuman performance practice and ambiguity of notation)
</p>
</div>
</div>
<div id="outline-container-org339c320" class="outline-3">
<h3 id="org339c320">Mediation</h3>
<div class="outline-text-3" id="text-org339c320">
<p>
Live processing mediates the sound between the performer and the audience. It can be simple amplification to complex live processing. Engineers also serve as mediators. These mediations create the posthuman musical context
</p>
</div>
</div>
<div id="outline-container-org2af22b4" class="outline-3">
<h3 id="org2af22b4">Tropes</h3>
<div class="outline-text-3" id="text-org2af22b4">
<p>
Frequent terms are mutation, hybridity, cyborg, virtuality, simulation, and disembodiment. These are all only possible using technology. Mutation modifies the input of the performer.Hybridity mixes human and electronic sound. Cyborg is also a mix but implies that technology is incorporated into the creation of musical gestures.Virtuality gives the impression of pressence or environment not physically located in the performance space. This comes from simulation that comes from things like spatial aoustic and specific timbres. Reverb copies the acoustics of a room for example.  Disembodiment is removing the sound from the source.
</p>
</div>
</div>
<div id="outline-container-org29eb305" class="outline-3">
<h3 id="org29eb305">Disconnect</h3>
<div class="outline-text-3" id="text-org29eb305">
<p>
There is a high degree of disconnect between the perceived sound on stage and the house balance.
</p>
</div>
</div>
<div id="outline-container-org59934f3" class="outline-3">
<h3 id="org59934f3">Agency and Tropes</h3>
<div class="outline-text-3" id="text-org59934f3">
<p>
Sometimes performers have high agency, and sometimes low agency in the posthuman context. The tropes will be used to enhance them instead of incompatible acoustic parallels.
</p>
</div>
</div>
<div id="outline-container-orgc0e5162" class="outline-3">
<h3 id="orgc0e5162">Posthuman</h3>
<div class="outline-text-3" id="text-orgc0e5162">
<p>
The meeting point of humans and machines that reconfigures humanistic conceptions of the autonomous, creative self.
</p>
</div>
</div>
<div id="outline-container-org4049bc4" class="outline-3">
<h3 id="org4049bc4">Music and Posthuman</h3>
<div class="outline-text-3" id="text-org4049bc4">
<p>
No where has technology infiltrated human culture so completely as it has in music.
</p>
</div>
</div>
<div id="outline-container-org18a3fc6" class="outline-3">
<h3 id="org18a3fc6">Mutation in Music</h3>
<div class="outline-text-3" id="text-org18a3fc6">
</div>
</div>
<div id="outline-container-org1367fed" class="outline-3">
<h3 id="org1367fed">Hybridity in Music</h3>
<div class="outline-text-3" id="text-org1367fed">
</div>
</div>
<div id="outline-container-org1e80147" class="outline-3">
<h3 id="org1e80147">Cyborg in music</h3>
<div class="outline-text-3" id="text-org1e80147">
</div>
</div>
<div id="outline-container-org8cf4ca1" class="outline-3">
<h3 id="org8cf4ca1">Interfaces</h3>
<div class="outline-text-3" id="text-org8cf4ca1">
<p>
Interfaces impact performance, because performers have to spend time learning to operate them. Especially when it requires new movement.
</p>
</div>
</div>
<div id="outline-container-orge0d1937" class="outline-3">
<h3 id="orge0d1937">Virtuality in Music</h3>
<div class="outline-text-3" id="text-orge0d1937">
<p>
Musicians may need to modify how they play when their sound is being processed.
</p>
</div>
</div>
<div id="outline-container-orgbc840a1" class="outline-3">
<h3 id="orgbc840a1">Dissembodiment in music</h3>
<div class="outline-text-3" id="text-orgbc840a1">
</div>
</div>
<div id="outline-container-orgad57fdb" class="outline-3">
<h3 id="orgad57fdb">Example of non cyborg</h3>
<div class="outline-text-3" id="text-orgad57fdb">
<p>
Here is an example where having a pedal is not cyborg, because the performer has no control over the outcome.
</p>
</div>
</div>
<div id="outline-container-orgd8f7ea0" class="outline-3">
<h3 id="orgd8f7ea0">Engineers</h3>
<div class="outline-text-3" id="text-orgd8f7ea0">
<p>
In some spaces the performer is at the mercy of the engineer, who is the one who knows what the music sounds like in the house. They have agency in this process of creating music.
</p>
</div>
</div>
<div id="outline-container-org89a8692" class="outline-3">
<h3 id="org89a8692">Preparation</h3>
<div class="outline-text-3" id="text-org89a8692">
<p>
Electronic part played no role in the performers creative process (in this piece) because they had no control over it
</p>
</div>
</div>
<div id="outline-container-org7512e32" class="outline-3">
<h3 id="org7512e32">Engineer as musician</h3>
<div class="outline-text-3" id="text-org7512e32">
<p>
One describes the engineer as a fifth chamber musician, and that he's playing a computer while they play a piece of wood. 
</p>
</div>
</div>
<div id="outline-container-orga14c22a" class="outline-3">
<h3 id="orga14c22a">Agency</h3>
<div class="outline-text-3" id="text-orga14c22a">
<p>
Performing with electronics and amplification the performer does not have total agency over their sound. There is a disconnect because the performer cannot adjust the mix while they are performing realistically.
</p>
</div>
</div>
<div id="outline-container-org28c4add" class="outline-3">
<h3 id="org28c4add">Mix of agency</h3>
<div class="outline-text-3" id="text-org28c4add">
<p>
Having your own in ear monitors can be a nice way for the performer to hear what they need in order to perform and allow an engineer to take care of the house.
</p>
</div>
</div>
<div id="outline-container-orgc1705db" class="outline-3">
<h3 id="orgc1705db">Performance Space</h3>
<div class="outline-text-3" id="text-orgc1705db">
<p>
In acoustic settings, it is not uncommon for musicians to adjust their tone, articulation, note lengths, etc to match the performance hall. Electronics complicate this a bit, and there is a bit of disconnect.
</p>
</div>
</div>
<div id="outline-container-orgd3e0223" class="outline-3">
<h3 id="orgd3e0223">Pedal Cyborg</h3>
<div class="outline-text-3" id="text-orgd3e0223">
<p>
Using effects pedals is cyborg because the performer works with their equipment to transform their sound.
</p>
</div>
</div>
<div id="outline-container-orgc951187" class="outline-3">
<h3 id="orgc951187">Posthuman tropes</h3>
<div class="outline-text-3" id="text-orgc951187">
<p>
Posthuman tropes provide a way to discuss electronic performance practice
</p>
</div>
</div>
<div id="outline-container-org4425e77" class="outline-3">
<h3 id="org4425e77">Controllers</h3>
<div class="outline-text-3" id="text-org4425e77">
<p>
Picking controllers is best considering what the tasks is. Sometimes a single button is all that is needed, some are more complex. 
</p>
</div>
</div>
<div id="outline-container-org48c8b8f" class="outline-3">
<h3 id="org48c8b8f">table of tropes</h3>
<div class="outline-text-3" id="text-org48c8b8f">
</div>
</div>
<div id="outline-container-org5057082" class="outline-3">
<h3 id="org5057082">Agency balance</h3>
<div class="outline-text-3" id="text-org5057082">
<p>
Distributed cognition can cause performers to be uncomfortable. An aspect of performance practice is to give enough agency over sound to the performers so they feel comfortable. Networks can be a way to look at this.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
